//==============================================================================
// Filename: Gfx_D3D12RootSigunature.h
// Description: ルートシグネチャクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __D3D12_ROOT_SIGNATURE_H__
#define __D3D12_ROOT_SIGNATURE_H__

// インクルード
#include <GraphicsSystem\Interface\Gfx_GraphicsResource.h>
#include <d3d12.h>
#include <wrl/client.h>

// 前方宣言
class GfxD3D12DescriptorHeap;

// クラス定義
class GfxD3D12RootSignature : GfxGraphicsObject<GfxD3D12RootSignature>
{
public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    GfxD3D12RootSignature();
    
    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    ~GfxD3D12RootSignature();

    //------------------------------------------------------------------------------
    /// ルートシグネチャの作成
    ///
    /// \param[in] pDescriptorHeap ディスクリプタヒープ
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    void Create(
        /*[in]*/
        GfxD3D12DescriptorHeap* pDescriptorHeap);

    //------------------------------------------------------------------------------
    /// ルートシグネチャのバインド
    ///
    /// \return ルートシグネチャのポインタ
    //------------------------------------------------------------------------------
    void Bind(
        /*[in]*/
        unsigned slot = 0) const final;

    //------------------------------------------------------------------------------
    /// ルートシグネチャの取得
    ///
    /// \return ルートシグネチャのポインタ
    //------------------------------------------------------------------------------
    inline ID3D12RootSignature* Get() const
    {
        return m_pRootSignature.Get();
    }

    //------------------------------------------------------------------------------

private:
    //------------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3DBlob>            m_pBlob;
    Microsoft::WRL::ComPtr<ID3D12RootSignature> m_pRootSignature;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_pBlob             ルートシグネチャデータ
    /// m_pRootSignature    ルートシグネチャ
    /// </summary> 
};
#endif // __D3D_MANAGER_H__
