//==============================================================================
// Filename: Gfx_D3D12MeshBuffer.h
// Description: Direct3D 12メッシュバッファー
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __D3D12_MESH_BUFFER_H__
#define __D3D12_MESH_BUFFER_H__

// インクルード
#include <GraphicsSystem\Interface\Gfx_MeshBuffer.h>

#include <wrl\client.h>
#include <d3d12.h>

// クラス定義
class GfxD3D12MeshBuffer : public GfxMeshBuffer
{
public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] shader
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    GfxD3D12MeshBuffer(Description desc);

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~GfxD3D12MeshBuffer();

    //------------------------------------------------------------------------------
    /// 頂点バッファの作成
    ///
    /// \return 作成できた場合 S_OK
    //------------------------------------------------------------------------------
    HRESULT CreateVertexBuffer() final;

    //------------------------------------------------------------------------------
    /// インデックスバッファの生成
    ///
    /// \return 作成できた場合 S_OK
    //------------------------------------------------------------------------------
    HRESULT CreateIndexBuffer() final;

    //------------------------------------------------------------------------------
    /// 頂点情報の更新
    ///
    /// \param[in] pData 頂点バッファのデータ
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    void Write(
        /*[in]*/
        void* pData) final;

    //------------------------------------------------------------------------------
    /// メッシュバッファの固定
    ///
    /// \param[in] slot レジスタ番号
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    void Bind(
        /*[in]*/
        unsigned int slot = 0) const final;

    //------------------------------------------------------------------------------

private:
    //------------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3D12Resource>      m_pVertexBuffer;
    Microsoft::WRL::ComPtr<ID3D12Resource>      m_pIndexBuffer;
    D3D12_VERTEX_BUFFER_VIEW                    m_vertexBufferView;
    D3D12_INDEX_BUFFER_VIEW                     m_indexBufferView;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_pVertexBuffer     頂点バッファ
    /// m_pIndexBuffer      インデックスバッファ
    /// m_vertexBufferView  頂点バッファビュー
    /// m_indexBufferView   インデックスバッファビュー
    /// </summary> 
};
#endif // __D3D12_MESH_BUFFER_H__
