//==============================================================================
// Filename: Gfx_D3D12VertexShader.h
// Description: Direct3D 12頂点シェーダークラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __D3D12_VERTEX_SHADER_H__
#define __D3D12_VERTEX_SHADER_H__

// インクルード
#include <GraphicsSystem\Interface\Gfx_Shader.h>
#include <d3d12.h>
#include <vector>

// クラス定義
class GfxD3D12VertexShader : public GfxVertexShader
{
public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] fileName シェーダーファイルのパス
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    GfxD3D12VertexShader(
        /*[in]*/
        const wchar_t* fileName);

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~GfxD3D12VertexShader();

    //------------------------------------------------------------------------------
    /// 頂点シェーダーのバインド
    /// 
    /// \param[in] slot レジスタ番号
    ///
    /// \return void
    //------------------------------------------------------------------------------
    void Bind(
        /*[in]*/
        unsigned int slot) const final;

    //------------------------------------------------------------------------------
    /// 頂点レイアウトの取得
    /// 
    /// \return 頂点レイアウト
    //------------------------------------------------------------------------------
    inline const D3D12_INPUT_ELEMENT_DESC* GetElement() const
    {
        return m_desc.pInputElementDescs;
    }

    //------------------------------------------------------------------------------
    /// インプットエレメントの数の取得
    /// 
    /// \return インプットエレメントの数
    //------------------------------------------------------------------------------
    inline const UINT GetElementCount() const
    {
        return m_desc.NumElements;
    }

    //------------------------------------------------------------------------------

private:
    //------------------------------------------------------------------------------
    D3D12_INPUT_ELEMENT_DESC* m_pInputDesc;
    D3D12_INPUT_LAYOUT_DESC m_desc;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_pInputDesc    インプットエレメント
    /// m_desc          インプットレイアウトの設定項目
    /// </summary> 
};
#endif // __D3D12_VERTEX_SHADER_H__
