//==============================================================================
// Filename: Gfx_ConstantBuffer.h
// Description: 定数バッファの基底クラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __CONSTANT_BUFER_H__
#define __CONSTANT_BUFER_H__

// インクルード
#include <GraphicsSystem\Interface\Gfx_GrapicsObjectBase.h>
#include <GraphicsSystem\Interface\Gfx_Tag.h>
#include <GraphicsSystem\Interface\Gfx_Shader.h>

// クラス定義
class GfxConstantBuffer : public GfxGraphicsObject<GfxConstantBuffer>
{
public:
    //------------------------------------------------------------------------------
    struct Description
    {
       unsigned int size;
       void* pData;
    };
    //------------------------------------------------------------------------------
    /// <summary>
    /// size    定数バッファのデータサイズ
    /// pData   定数バッファのデータ
    /// </summary> 

public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] desc 定数バッファの設定項目
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    GfxConstantBuffer(
        /*[in]*/
        Description desc);

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~GfxConstantBuffer();

    //------------------------------------------------------------------------------
    /// 定数バッファの更新
    ///
    /// \param[in] pData 定数バッファのデータ
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    virtual void Write(
        /*[in]*/
        void* pData) = 0;

    //------------------------------------------------------------------------------
    /// 定数バッファを頂点シェーダーにセットする
    ///
    /// \param[in] slot レジスタ番号
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    virtual void BindVS(
    /*[in]*/
    unsigned slot) = 0;

    //------------------------------------------------------------------------------
    /// 定数バッファをピクセルシェーダーにセットする
    ///
    /// \param[in] slot レジスタ番号
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    virtual void BindPS(
        /*[in]*/
        unsigned slot) = 0;

    //------------------------------------------------------------------------------
    /// 定数バッファの作成
    /// 
    /// \param[in] tag  リソースに紐づけるタグ
    /// \param[in] desc 定数バッファの設定項目
    ///
    /// \return このクラスのポインタ
    //------------------------------------------------------------------------------
    static GfxConstantBuffer::Ptr Create(
        /*[in]*/
        const GfxTag& tag,
        /*[in]*/
        Description desc);
    
    //------------------------------------------------------------------------------

protected:
    //------------------------------------------------------------------------------
    Description m_desc;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_desc      定数バッファの設定項目
    /// </summary> 
};
#endif // __CONSTANT_BUFER_H__
