//==============================================================================
// Filename: Gfx_GraphicsManager.cpp
// Description: DirectX11 or 12 の管理クラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================


// インクルード
#include <GraphicsSystem\Interface\Gfx_OpenGLManager_Impl.h>

//------------------------------------------------------------------------------
/// コンストラクタ
///
/// \return void
//------------------------------------------------------------------------------
GfxOpenGL::GfxOpenGL()
{
}

//------------------------------------------------------------------------------
/// デストラクタ
///
/// \return void
//------------------------------------------------------------------------------
GfxOpenGL::~GfxOpenGL()
{
}

//------------------------------------------------------------------------------
/// グラフィックスAPIの初期化
///
/// \param[in] width    ウィンドウの幅
/// \param[in] height   ウィンドウの高さ
///
/// \return 初期化処理の成否
//------------------------------------------------------------------------------
void GfxOpenGL::Init(int width, int height)
{
    // apiの種類がOpenGLでなければ警告を出す
    API_KIND type = GRAPHICS->GetAPIKind();
    if (type != API_KIND::OPEN_GL)
    {
        _ASSERT_EXPR(false, L"NO_GRAPHICS");
    }

    // 作業途中（警告を消すための処理）
    int a, b;
    a = width;
    b = height;
}


//------------------------------------------------------------------------------
/// グラフィックスAPIの終了処理
///
/// \return void
//------------------------------------------------------------------------------
void GfxOpenGL::Uninit()
{
}

//------------------------------------------------------------------------------
/// 描画の開始(バックバッファ＆Ｚバッファのクリア)
///
/// \return void
//------------------------------------------------------------------------------
void GfxOpenGL::BeginDraw()
{
    
}

//------------------------------------------------------------------------------
/// 描画の修了(バックバッファとフロントバッファの入れ替え)
///
/// \return void
//------------------------------------------------------------------------------
void GfxOpenGL::EndDraw()
{
    
}
