//==============================================================================
// Filename: Gfx_Tag.h
// Description: グラフィックオブジェクトを識別するタグクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __TAG_H__
#define __TAG_H__

// インクルード
#include <string>

// クラス定義
class GfxTag
{
public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \param[in] name タグの名前
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    GfxTag(
        /*[in]*/
        const char* name);

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    ~GfxTag();

    bool operator==(const GfxTag& tag) const;
    bool operator!=(const GfxTag& tag) const;
    bool operator<(const GfxTag& tag) const;

    //------------------------------------------------------------------------------

private:
    //------------------------------------------------------------------------------
    std::string m_name;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_tag         グラフィックオブジェクトを識別する名前
    /// </summary> 


};

#endif // __TAG_H__
