//==============================================================================
// Filename: IGfx_RenderTarget.h
// Description: レンダーターゲットのインターフェースクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __RENDER_TARGET_H__
#define __RENDER_TARGET_H__

// インクルード
#include <Windows.h>
#include <dxgi.h>

// 前方宣言
class IGfxDevice;
class IGfxSwapChain;

// クラス定義
class IGfxRenderTarget
{
public:
    //------------------------------------------------------------------------------
    struct Description
    {
        DXGI_FORMAT fromat;
        UINT bufferCount;
    };
    //------------------------------------------------------------------------------
    /// <summary>
    /// fromat      描画のフォーマット
    /// bufferCount バッファの数
    /// </summary>

public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    IGfxRenderTarget() {};

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~IGfxRenderTarget() {};

    //------------------------------------------------------------------------------
    /// レンダーターゲットの生成
    ///
    /// \param[in] desc         設定項目
    /// \param[in] pDevice      デバイス
    /// \param[in] pSwapChain   スワップチェーン
    /// 
    /// \return 生成できた場合 S_OK
    //------------------------------------------------------------------------------
    virtual HRESULT Create(
    /*[in]*/
    const Description& desc,
    /*[in]*/
    IGfxDevice* pDevice,
    /*[in]*/
    IGfxSwapChain* pSwapChain) = 0;

    //------------------------------------------------------------------------------
};
#endif // __RENDER_TARGET_H__
