//==============================================================================
// Filename: IGfx_SwapChain.h
// Description: スワップチェーンのインターフェースクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __SWAP_CHAIN_H__
#define __SWAP_CHAIN_H__

// インクルード
#include <dxgi.h>
#include <Windows.h>

// 前方宣言
class IGfxDevice;
class IGfxRenderCommand;

// クラス定義
class IGfxSwapChain
{
public:
    //------------------------------------------------------------------------------
    struct Description
    {
        UINT width;
        UINT height;
        HWND hWnd;
        DXGI_FORMAT fromat;
        DXGI_SWAP_EFFECT swapEffect;
        DXGI_USAGE bufferUsage;
        UINT bufferCount;
        UINT flag;
    };
    //------------------------------------------------------------------------------
    /// <summary>
    /// width       画面の幅
    /// height      画面の高さ
    /// hWnd        画面の高さウィンドウハンドル
    /// fromat      描画のフォーマット
    /// swapEffect  バッグバッファの処理方法のオプション
    /// bufferUsage バッグバッファの使用用途
    /// bufferCount バッファの数
    /// flag        スワップチェーンのオプション
    /// </summary>

public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    IGfxSwapChain() {};

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~IGfxSwapChain() {};

    //------------------------------------------------------------------------------
    /// スワップチェーンの生成
    ///
    /// \param[in] desc             スワップチェーンの設定項目
    /// \param[in] pDevice          デバイス
    /// \param[in] pRenderCommand   デバイスコンテクスト
    /// 
    /// \return 生成できた場合 S_OK
    //------------------------------------------------------------------------------
    virtual HRESULT Create(
    /*[in]*/
    const Description& desc,
    /*[in]*/
    IGfxDevice* pDevice,
    /*[in]*/
    IGfxRenderCommand* pRenderCommand) = 0;

    //------------------------------------------------------------------------------
    /// フロントバッファとバックバッファの入れ替え
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual void Present() const = 0;

    //------------------------------------------------------------------------------
};

#endif // __SWAP_CHAIN_H__
