//==============================================================================
// Filename: IGfx_ViewPort.h
// Description: ビューポートのインターフェースクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __VIEW_PORT_H__
#define __VIEW_PORT_H__

// インクルード
#include <Windows.h>

// 前方宣言
class IGfxDevice;

// クラス定義
class IGfxViewPort
{
public:
    //------------------------------------------------------------------------------
    struct Description
    {
        float width;
        float height;
        float TopLeftX;
        float TopLeftY;
        float MinDepth;
        float MaxDepth;
    };

    //------------------------------------------------------------------------------
    /// <summary>
    /// width       // 出力先の幅（ピクセル数）
    /// height      // 出力先の高さ（ピクセル数）
    /// TopLeftX    // 出力先の左上座標X
    /// TopLeftY    // 出力先の左上座標Y
    /// MinDepth    // 深度値の最小値
    /// MaxDepth    // 深度値の最大値
    /// </summary>

public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    IGfxViewPort() {};

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~IGfxViewPort() {};

    //------------------------------------------------------------------------------
    /// ビューポートの指定
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual void Bind() const = 0;

    //------------------------------------------------------------------------------
};
#endif // __VIEW_PORT_H__
