//==============================================================================
// Filename: IGfx_RenderCommand.h
// Description: 描画命令クラスのインターフェースクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __RENDER_COMMAND_H__
#define __RENDER_COMMAND_H__

// 前方宣言
class IGfxRenderTarget;
class IGfxDepthStencil;

// クラス定義
class IGfxRenderCommand
{
public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    IGfxRenderCommand() {};

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~IGfxRenderCommand() {};

    //------------------------------------------------------------------------------
    /// バックバッファのクリア
    ///
    /// \param[in] pRenderTagetView レンダーターゲット
    /// \param[in] clearColor       クリアする色
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    virtual void ClearRenderTargetView(
    /*[in]*/
    IGfxRenderTarget* pRenderTagetView,
    /*[in]*/
    const float clearColor[4]) const = 0;

    //------------------------------------------------------------------------------
    /// Zバッファのクリア
    ///
    /// \param[in] pDepthStencilView    デプスステンシルビュー
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    virtual void ClearDepthStencilView(
    /*[in]*/
    IGfxDepthStencil* pDepthStencilView) const = 0;

    //------------------------------------------------------------------------------
    /// レンダーターゲットビューとデプスステンシルビューの指定
    /// DX12の場合　リソースバリアの設定もここで行っている
    /// 
    /// \param[in] pRenderTagetView     レンダーターゲットビュー
    /// \param[in] pDepthStencilView    デプスステンシルビュー
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual void OMSetRenderTargets(
    /*[in]*/
    IGfxRenderTarget* pRenderTagetView,
    /*[in]*/
    IGfxDepthStencil* pDepthStencilView) = 0;

    //------------------------------------------------------------------------------
    /// 描画終了命令（バクバッファとフロントバッファの入れ替え）
    /// DX12の場合　リソースバリアの設定もここで行っている
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual void EndDraw() = 0;

    //------------------------------------------------------------------------------
};
#endif // __RENDER_COMMAND_H__
