//==============================================================================
// Filename: IGfx_DepthStencilView.h
// Description: デプスステンシルビューのインターフェースクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __DEPTH_STENCIL_VIEW_H__
#define __DEPTH_STENCIL_VIEW_H__

// インクルード
#include <Windows.h>
#include <dxgi.h>

// 前方宣言
class IGfxDevice;

// クラス定義
class IGfxDepthStencil
{
public:
    //------------------------------------------------------------------------------
    struct Description
    {
        UINT width;
        UINT height;
    };
    //------------------------------------------------------------------------------
    /// <summary>
    /// width   レンダーターゲットと同じ幅
    /// height  レンダーターゲットと同じ高さ
    /// </summary>

public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    IGfxDepthStencil() {};

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~IGfxDepthStencil() {};

    //------------------------------------------------------------------------------
    /// デプスステンシルビューの生成
    ///
    /// \param[in] desc     設定項目 
    /// \param[in] pDevice  デバイス
    /// 
    /// \return 生成できた場合 S_OK
    //------------------------------------------------------------------------------
    virtual const HRESULT Create(
    /*[in]*/
    const Description& desc,
    /*[in]*/
    IGfxDevice* pDevice) = 0;

    //------------------------------------------------------------------------------
};
#endif // __RENDER_TARGET_H__
