//==============================================================================
// Filename: Gfx_Texture.h
// Description: テクスチャクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __TEXTURE_H__
#define __TEXTURE_H__

// インクルード
#include  <Win_Main.h>
#include <d3d11.h>
#include <DirectXMath.h>
#include <wrl/client.h>
#include <dxgi.h>
#include <d2d1.h>
#include <d2d1_1.h>

// クラス定義
class GfxTexture
{
public:
    //------------------------------------------------------------------------------
    
    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    GfxTexture();

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    ~GfxTexture();

    //------------------------------------------------------------------------------
    /// サンプラーの初期化
    ///
    /// \return 初期化の成否
    //------------------------------------------------------------------------------
    HRESULT Init();

    //------------------------------------------------------------------------------
    /// ID3D11Texture11 or 12 からシェーダーリソースビューを作成する
    ///
    /// \return 作成の成否
    //------------------------------------------------------------------------------
    HRESULT CreateShaderResourceFromTexture2D();

    //------------------------------------------------------------------------------
    /// シェーダーリソースをピクセルシェーダーに渡す
    ///
    /// \param[in] slot スロット
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    void SetTexturePS(
    /*[in]*/
    UINT slot);

    //------------------------------------------------------------------------------
    /// シェーダーリソースを頂点シェーダーに渡す
    ///
    /// \param[in] slot スロット
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    void SetTextureVS(
    /*[in]*/
    UINT slot);

    //------------------------------------------------------------------------------
    /// サンプラーをピクセルシェーダーに渡す
    ///
    /// \param[in] slot スロット
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    void SetSamplerPS(
    /*[in]*/
    UINT slot);

    //------------------------------------------------------------------------------

private:
    //------------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<ID3D11Texture2D> m_pTexture2D;
    Microsoft::WRL::ComPtr<ID3D11ShaderResourceView> m_pShaderResourceView;
    ID3D11SamplerState* m_pSamplerState;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_pTexture2D  テクスチャ
    /// m_pShaderResourceView シェーダーリソース
    /// m_pSamplerState サンプラー
    /// </summary> 
};

#endif //! __TEXTURE_H__
