//==============================================================================
// Filename: Gfx_VertexShader.h
// Description: 頂点シェーダーに関するクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

//! インクルードガード
#ifndef __VERTEX_SHADER_H__
#define __VERTEX_SHADER_H__

//! インクルード
#include <GraphicsSystem\DirectX\Gfx_Shader.h>
#include <string>
#include <map>

//! クラス定義
class GfxVertexShader : public GfxShader
{

public:
    //---------------------------------------------------------------------------
    
    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    GfxVertexShader();

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    ~GfxVertexShader();

    //------------------------------------------------------------------------------
    /// シェーダーを描画に使用
    ///
    /// \return void
    //------------------------------------------------------------------------------
    void Bind() override;

    //------------------------------------------------------------------------------
    /// インプットレイアウトの開放
    ///
    /// \return void
    //------------------------------------------------------------------------------
    static void ReleaseInputLayout();

    //---------------------------------------------------------------------------

protected:
    //---------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// シェーダーファイルを読み込んだ後、シェーダーの種類別に処理を行う
    ///
    /// \param[in] pData シェーダーのデータへのポインタ
    /// \param[in] size データの大きさ
    /// 
    /// \return シェーダー作成の成否
    //------------------------------------------------------------------------------
    virtual HRESULT MakeShader(
    /*[in]*/
    void* pData,
    /*[in]*/
    UINT size) override;

    //---------------------------------------------------------------------------

private:

    //---------------------------------------------------------------------------
    static std::map<std::string, ID3D11InputLayout*> m_inputLayoutList;
    ID3D11VertexShader* m_pVS;
    ID3D11InputLayout* m_pInputLayout;
    //---------------------------------------------------------------------------
    /// <summary>
    /// m_inputLayoutList   インプットレイアウトのリスト
    /// m_pVS               頂点シェーダー
    /// m_pInputLayout      インプットレイアウト
    /// </summary> 
};

#endif //! __SHADER_H__
