//==============================================================================
// Filename: IGfx_D3D11SwapChain_Impl.h
// Description: Direct3D 11のスワップチェーンクラス
// Copyright (C) Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __D3D11_SWAP_CHAIN_H__
#define __D3D11_SWAP_CHAIN_H__

// インクルード
#include <GraphicsSystem\Interface\IGfx_SwapChain.h>
#include <dxgi1_6.h>
#include <wrl\client.h>

// クラス定義
class GfxD3D11SwapChain : public IGfxSwapChain
{
public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    GfxD3D11SwapChain();

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    ~GfxD3D11SwapChain();

    //------------------------------------------------------------------------------
    /// スワップチェーンの生成
    ///
    /// \param[in] desc             スワップチェーンの設定項目
    /// \param[in] pDevice          デバイス
    /// \param[in] pRenderCommand   デバイスコンテクスト
    /// 
    /// \return 生成できた場合 S_OK
    //------------------------------------------------------------------------------
    HRESULT Create(
    /*[in]*/
    const Description& desc,
    /*[in]*/
    IGfxDevice* pDevice,
    /*[in]*/
    IGfxRenderCommand* pRenderCommand) final;

    //------------------------------------------------------------------------------
    /// フロントバッファとバックバッファの入れ替え
    ///
    /// \return void
    //------------------------------------------------------------------------------
    void Present() const final;
    
    //------------------------------------------------------------------------------
    /// スワップチェーンの取得
    ///
    /// \return スワップチェーン
    //------------------------------------------------------------------------------
    IDXGISwapChain* GetSwapChain() const
    {
        return m_pSwapChain.Get();
    }

    //------------------------------------------------------------------------------

private:
    //------------------------------------------------------------------------------
    Microsoft::WRL::ComPtr<IDXGISwapChain> m_pSwapChain;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_pSwapchain    スワップチェーン
    /// </summary>

};
#endif // __D3D12_SWAP_CHAIN_H__
