//==============================================================================
// Filename: IPlatform.h
// Description: プラットフォームの基底クラス
// Copyright (C) 2013 Silicon Studio Co., Ltd. All rights reserved.
//==============================================================================

// インクルードガード
#ifndef __PLATFORM_H__
#define __PLATFORM_H__

#include <memory>
#include <tchar.h>

// マクロ定義
#define SCREEN_WIDTH  (1280)                // ウインドウの幅
#define SCREEN_HEIGHT (720)                 // ウインドウの高さ
#define SCREEN_CENTER_X (SCREEN_WIDTH / 2)  // ウインドウの中心Ｘ座標
#define SCREEN_CENTER_Y (SCREEN_HEIGHT/ 2)  // ウインドウの中心Ｙ座標

// 列挙体宣言
enum class API_KIND
{
    DIRECT3D_11,
    DIRECT3D_12,
    OPEN_GL,
    VULKAN,
};

// クラス定義
class IPlatform
{
public:
    //using Ptr = std::unique_ptr<IPlatform>;

public:
    //------------------------------------------------------------------------------
    struct Description
    {
        unsigned int width;
        unsigned int height;
        const wchar_t* tileName;
    };
    //------------------------------------------------------------------------------
    /// <summary>
    /// width       ウィンドウの幅
    /// height      ウィンドウの高さ
    /// tileName    タイトル名
    /// </summary>

public:
    //------------------------------------------------------------------------------

    //------------------------------------------------------------------------------
    /// コンストラクタ
    /// 
    /// \return void
    //------------------------------------------------------------------------------
    IPlatform(){}

    //------------------------------------------------------------------------------
    /// デストラクタ
    ///
    /// \return void
    //------------------------------------------------------------------------------
    virtual ~IPlatform(){}

    //------------------------------------------------------------------------------
    /// 初期化
    /// 
    /// \param[in] desc ウィンドウの設定項目
    /// 
    /// \return 成功時 true
    //------------------------------------------------------------------------------
    virtual bool Init(
        /*[in]*/
        Description desc) = 0;

    //------------------------------------------------------------------------------
    /// メッセージループ
    /// 
    /// \return 
    //------------------------------------------------------------------------------
    virtual bool Run() = 0;

    //------------------------------------------------------------------------------
    /// ウィンドウ作成
    /// 
    /// \param[in] kind APIの種類
    /// \param[in] desc プラットフォームの設定項目
    /// 
    /// \return このクラスのインスタンス
    //------------------------------------------------------------------------------
    static IPlatform* Make(API_KIND kind, Description desc);

    //------------------------------------------------------------------------------

protected:
    //------------------------------------------------------------------------------
    static std::unique_ptr<IPlatform> m_pPlatform;
    static Description m_desc;
    //------------------------------------------------------------------------------
    /// <summary>
    /// m_pWindow プラットフォームのインスタンス
    /// m_width   画面の幅
    /// m_height  画面の高さ
    /// </summary>
};

#endif // !__PLATFORM_H__
